from src.api.dependencies import get_db_manager
from src.schemas.details import RequestAddDetails
from src.schemas.services import RequestAddService

import asyncio
from sqlalchemy import text

details = ["Капот", "Лобовое стекло", "Боковое стекло",
           "Заднее стекло", "Дверь", "Фары передние",
           "Фары задние", "Стойки лобового стекла",
           "Стойки глянцевые", "Крышка багажника",
           "Бампер передний", "Бампер Задний",
           "Передние крылья","Задние Крылья","Крыша", "Зеркала заднего вида",
           "Полоса крыши", "Полоса крышки багажника", "Полоса заднего бампера",
           "Зоны под ручками", "Салон", "Кузов", "Пороги",
           "Комплекс «Зоны риска»", "Задний полукруг",
           "Передние боковые стекла", "Передний полукруг с лобовым"
           ]
services = [
    "Винил", "Тонировка затемненной пленкой",
    "Тонировка атермальной пленкой", "Тонировка хамелеон",
    "Полиуретан", "Бронирование лобового стекла",
    "Полировка фар", "Установка защитной сетки в бампер",
    "Установка мультимедиа", "Установка камер заднего вида",
    "Шумоизоляция автомобиля"
]
details_services = [
    ("Капот", "Полиуретан", 17000),
    ("Лобовое стекло", "Тонировка затемненной пленкой", 3500),
    ("Лобовое стекло", "Бронирование лобового стекла", 22000),
    ("Боковое стекло", "Тонировка затемненной пленкой", 1300),
    ("Заднее стекло", "Тонировка затемненной пленкой", 1500),
    ("Дверь", "Полиуретан", 10000),
    ("Фары передние", "Тонировка затемненной пленкой", 3000),
    ("Фары передние", "Полиуретан", 4000),
    ("Фары задние", "Тонировка затемненной пленкой", 6000),
    ("Фары задние", "Полиуретан", 3000),
    ("Стойки лобового стекла", "Полиуретан", 2000),
    ("Стойки глянцевые", "Полиуретан", 1000),
    ("Крышка багажника", "Полиуретан", 6000),
    ("Бампер передний", "Полиуретан", 17000),
    ("Бампер Задний", "Полиуретан", 17000),
    ("Передние крылья", "Полиуретан", 15000),
    ("Задние Крылья", "Полиуретан", 15000),
    ("Крыша", "Полиуретан", 17000),
    ("Зеркала заднего вида", "Полиуретан", 4000),
    ("Полоса крыши","Полиуретан", 2000),
    ("Полоса крышки багажника", "Полиуретан", 1000),
    ("Полоса заднего бампера", "Полиуретан", 1000),
    ("Зоны под ручками", "Полиуретан", 500),
    ("Фары передние","Полировка фар", 2000),
    ("Бампер передний", "Установка защитной сетки в бампер", 5000),
    ("Салон", "Установка мультимедиа", 2500),
    ("Салон", "Установка камер заднего вида", 2500),
    ("Кузов", "Шумоизоляция автомобиля", 0),
    ("Пороги", "Полиуретан", 1000),
    ("Комплекс «Зоны риска»", "Полиуретан", 31000),
    ("Задний полукруг", "Тонировка затемненной пленкой", 4500),
    ("Передние боковые стекла", "Тонировка затемненной пленкой", 2500),
    ("Передний полукруг с лобовым", "Тонировка затемненной пленкой", 6000),
    ("Передний полукруг с лобовым", "Тонировка атермальной пленкой", 12000),
    ("Передний полукруг с лобовым", "Тонировка хамелеон", 12000)
]


async def seed():
    print("Начало заполнения таблиц...")
    async with get_db_manager() as db:

        if any([not await db.services.is_empty(),
               not await db.details.is_empty(),
               not await db.services_details.is_empty()
                ]):
            print("В таблицах уже есть данные. Перезаписываем (TRUNCATE)...")
            await db.session.execute(text("TRUNCATE TABLE services_details, services, details RESTART IDENTITY CASCADE;"))

        for detail in details:
            await db.details.add(RequestAddDetails(name_detail=detail))
        print("Таблица деталей заполнена")

        for service in services:
            await db.services.add(RequestAddService(name_service=service))
        print("Таблица сервисов")

        for detail_name, service_name, price in details_services:
            await db.services_details.add_by_names(detail_name, service_name, price)
        print("Таблица зависимостей деталей с сервисами заполнена")

        await db.commit()
    print("Таблицы заполнены!")

if __name__ == "__main__":
    asyncio.run(seed())