from src.api.dependencies import get_db_manager
from src.schemas.details import RequestAddDetails
from src.schemas.services import RequestAddService

import asyncio

details = ["Капот", "Лобовое стекло", "Боковое стекло",
           "Заднее стекло", "Дверь", "Фары передние",
           "Фары задние", "Стойки лобового стекла",
           "Стойки глянцевые", "Крышка багажника",
           "Бампер передний", "Бампер Задний",
           "Передние крылья","Задние Крылья","Крыша", "Зеркала заднего вида"]
services = ["Винил", "Тонировка", "Полиуретан", "Бронирование лобового стекла"]
details_services = [
    ("Капот", "Винил", 20000),
    ("Капот", "Полиуретан", 17000),
    ("Лобовое стекло", "Тонировка", 6000),
    ("Лобовое стекло", "Бронирование лобового стекла", 14000),
    ("Боковое стекло", "Тонировка", 2500),
    ("Заднее стекло", "Тонировка", 5000),
    ("Дверь", "Винил", 12000),
    ("Дверь", "Полиуретан", 10000),
    ("Фары передние", "Тонировка", 3000),
    ("Фары передние", "Полиуретан", 4000),
    ("Фары задние", "Тонировка", 2000),
    ("Фары задние", "Полиуретан", 3000),
    ("Стойки лобового стекла", "Винил", 3000),
    ("Стойки лобового стекла", "Полиуретан", 2000),
    ("Стойки глянцевые", "Полиуретан", 1000),
    ("Крышка багажника", "Винил", 8000),
    ("Крышка багажника", "Полиуретан", 6000),
    ("Бампер передний", "Винил", 20000),
    ("Бампер передний", "Полиуретан", 17000),
    ("Бампер Задний", "Винил", 20000),
    ("Бампер Задний", "Полиуретан", 17000),
    ("Передние крылья", "Винил", 17000),
    ("Передние крылья", "Полиуретан", 15000),
    ("Задние Крылья", "Винил", 17000),
    ("Задние Крылья", "Полиуретан", 15000),
    ("Крыша", "Винил", 20000),
    ("Крыша", "Полиуретан", 17000),
    ("Зеркала заднего вида", "Полиуретан", 2000)
]


async def seed():
    print("Начало заполнения таблиц...")
    async with get_db_manager() as db:

        if any([not await db.services.is_empty(),
               not await db.details.is_empty(),
               not await db.services_details.is_empty()
                ]):
            print("В таблицах уже есть какие-то данные")
            return

        for detail in details:
            await db.details.add(RequestAddDetails(name_detail=detail))
        print("Таблица деталей заполнена")

        for service in services:
            await db.services.add(RequestAddService(name_service=service))
        print("Таблица сервисов")

        for detail_name, service_name, price in details_services:
            await db.services_details.add_by_names(detail_name, service_name, price)
        print("Таблица зависимостей деталей с сервисами заполнена")

        await db.commit()
    print("Таблицы заполнены!")

if __name__ == "__main__":
    asyncio.run(seed())